sc_vods/app/controllers/vods_controller.rb

  def index
    @vods = Vod.all
---
SELECT * FROM "vods"

  def show
    @vod = Vod.find(params[:id])
---
SELECT * FROM "vods" WHERE ("vods"."id" = 1)

  def create
    @vod = Vod.new(params[:vod])

    respond_to do |format|
      if @vod.save
---
INSERT INTO "vods" ("is_tournament", "created_at", "updated_at", "url") VALUES('f', '2011-09-01 04:35:57', '2011-09-01 04:35:57', 'http://www.youtube.com/watch?v=wkm-2v1VfrM')